import re
dict_clumn = {'list_26490':'汽车圈','list_26404':'赢家','list_26202':'亲子学堂',
'list_26173':'视界','list_25990':'澎湃联播','list_25769':'生活方式',
'list_26862':'楼市','list_80623':'非常品','list_25842':'私家地理','list_25599':'运动家',
'list_26015':'私·奔','list_25942':'身体','list_26609':'文艺范','list_25448':'有戏',
'list_26506':'异次元','channel_25953':'生活','list_25536':'专栏',
'list_25446':'智库报告','list_26915':'城市漫步','list_25456':'市政厅',
'list_25445':'澎湃研究所','list_25482':'逝者','list_25450':'文化课',
'list_26937':'古代艺术','list_25455':'艺术评论', 'list_25574':'翻书党',
'list_25457':'私家历史','list_25483':'思想市场','list_26878':'上海书评',
'list_26525':'思想湃','list_27224':'澎湃评论','list_25444': '社论',
'channel_25952':'思想','channel_77286':'媒体','channel_27392':'政务',
'channel_36079':'湃客','list_37978':'进博会在线','list_25432':'自贸区连线','list_25485':'澎湃商学院',
'list_27234':'科技湃','list_25437':'牛市点线面','list_25435':'金改实验室',
'list_25438':'财经上下游','list_25433':'地产界', 'list_25436':'能见度',
'list_25434':'财经10%公司','list_25600':'快看','list_25635':'美数课', 'list_25634':'全景现场',
'list_25487':'教育家','list_25422':'浦江头条','list_25427':'澎湃人物','list_25678':'唐人街',
'list_25430':'澎湃防务','list_25481':'外交学人','list_25429':'澎湃国际',
'list_25425':'绿政公署','list_25464':'澎湃质量报告','list_27604':'暖闻',
'list_68750':'公益湃','list_25428':'直击现场','list_25491':'长三角政商',
'list_25463':'港台来信','list_25424':'一号专案', 'list_25426':'法治中国','list_25423':'人事风向',
'list_25490':'打虎记','list_25489':'舆论场','list_25462':'中国政库','list_25488':'中南海',
'channel_25950':'时事栏目',}
class tools_spider:
    #去除字符串中的html标签
    def str_tool_html(self,str_html):
        str_tool_html=''.join(str_html)
        str_tool_html=re.sub('<[^<]+?>', '', str_tool_html).replace('\n', '').strip()
        # print(str_tool_html)
        return str_tool_html




